<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class CommentsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        
        // 既存のデータをランダムに取得
        $users = DB::table('users')->pluck('id')->toArray();
        $posts = DB::table('posts')->pluck('id')->toArray();
        
        $commentContents = [
            "おめでとうございます！合格の瞬間は一生の思い出となります。これからの道のりも楽しみです。これまでの努力が報われて、未来に向けて更なる成功が期待できます。",
            "素晴らしい結果ですね。これからのステップも楽しみです。合格を知った瞬間、感動と達成感がこみ上げてきます。これからも同じ情熱を持ち、更なる高みを目指してください。",
            "合格おめでとうございます！どの科目が一番難しかったですか？苦労した分、成果が大きいですね。これからも学び続け、専門知識を深めていってください。",
            "お疲れ様でした。次のステップも頑張ってくださいね。試験勉強は大変なことでしょうが、その成果が実った瞬間です。これからのキャリアに期待が膨らみます。",
            "これは素晴らしいニュースです！おめでとうございます。合格したことで新たな可能性が広がります。これからのステップで更なる成長を遂げてください。",
            "頑張りが実りましたね。これからも更なる成功を期待しています。苦労や困難があったかもしれませんが、その分だけ成果が素晴らしいものになります。",
            "お疲れ様でした。これからの挑戦が楽しみです。おめでとうございます。試験をクリアしたことで、新しいステージに進むことができます。今後も一緒に頑張りましょう。",
            "これからも同じ情熱で頑張りましょう。おめでとうございます。合格を迎えたことで、これからのキャリアに更なる自信が生まれます。未来が楽しみです。",
            "合格おめでとうございます！今後のキャリアがますます輝くことでしょう。この成果はあなたの努力の結晶です。これからも一緒に目標に向かって進んでいきましょう。",
            "お疲れさまでした。成功への努力が報われた瞬間ですね。これからも更なる挑戦が待っています。合格おめでとうございます。",
            "記事を読んで少し物足りない気がしました。もっと詳細な経験や工夫、苦労話を聞きたかったです。もう少し深堀りした内容だともっと価値があると感じます。",
            "他の記事と比べて、これはちょっと物足りない感じがしました。もっと踏み込んだエピソードや困難を乗り越えたエピソードがあれば、読む価",
            "あまりにもポジティブすぎるコメントが多いと、リアルな感覚が欠けると感じました。もう少し現実的な経験や課題も共有してほしかったです。",
            "記事の内容が抽象的すぎて、実際の経験や苦労がよくわからなかったです。もっと具体的でリアルなエピソードや課題についても触れてほしかったです。",
            "最後のコメントが途中で終わってしまいました。お詫び申し上げます。もう少し具体的な意見や感想を共有していただけると、記事全体に深みが増すかと思います。",
        ];

        // ポストデータを追加
        $comments = [];

        for ($i = 0; $i < 30; $i++) {
            $comments[] = [
                'id' => Str::uuid(),
                'user_id' => $users[array_rand($users)],
                'post_id' => $posts[array_rand($posts)],
                'content' => $commentContents[array_rand($commentContents)],
                'created_at' => now()->subDays(rand(1, 365))->format('Y-m-d H:i:s'),
                'updated_at' => now()->format('Y-m-d H:i:s'),
            ];
        }

        foreach ($comments as $comment) {
            DB::table('comments')->insert($comment);
        }
    }
}
